//
//  TextMojiData.swift
//  TextMoji
//
//  Created by Oguz Demırhan on 22.04.2021.
//

import Foundation


struct TextMojiData {
    
    let lennyFaces = ["( ͡° ͜ʖ ͡°)","( ͠° ͟ʖ ͡°)","( ͡~ ͜ʖ ͡°)","( ͡ʘ ͜ʖ ͡ʘ)",
                      "( ͡o ͜ʖ ͡o)","(° ͜ʖ °)","( ‾ʖ̫‾)","( ಠ ͜ʖಠ)",
                      "( ͡° ʖ̯ ͡°)","( ͡ಥ ͜ʖ ͡ಥ)","༼  ͡° ͜ʖ ͡° ༽","(▀̿Ĺ̯▀̿ ̿)",
                      "( ✧≖ ͜ʖ≖)","(ง ͠° ͟ل͜ ͡°)ง","(͡ ͡° ͜ つ ͡͡°)","[̲̅$̲̅(̲̅ ͡° ͜ʖ ͡°̲̅)̲̅$̲̅]"
                      ,"(✿❦ ͜ʖ ❦)","ᕦ( ͡° ͜ʖ ͡°)ᕤ","( ͡° ͜ʖ ͡°)╭∩╮","(╯ ͠° ͟ʖ ͡°)╯┻━┻",
                      "( ͡°( ͡° ͜ʖ( ͡° ͜ʖ ͡°)ʖ ͡°) ͡°)","¯\\_(ツ)_ /¯","ಠ_ಠ"
    ]
    
    
    let japaneseTextMojisJoy = ["(* ^ ω ^)","(o･ω･o)","( ´ ω ` )","(^人^)",
                             "(((o(*°▽°*)o)))","٩(◕‿◕｡)۶","<(￣︶￣)>","ヽ(*・ω・)ﾉ",
                             "(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧","(*꒦ິ꒳꒦ີ)","(っ˘ω˘ς )","°˖✧◝(⁰▿⁰)◜✧˖°","(⁀ᗢ⁀)"
    
    ]
    
    let japaneseTextMojisLove = ["(ﾉ´ з `)ノ","(♡-_-♡)","(￣ε￣＠)","ヽ(♡‿♡)ノ","(❤ω❤)",
                                 "♡＼(￣▽￣)／♡","(≧◡≦) ♡","╰(*´︶`*)╯♡","♡( ◡‿◡ )",
                                 "(♡°▽°♡)","(⌒▽⌒)♡","♡(｡- ω -)"
    ]
    
    let japaneseTextMojisEmbarrassment = ["(⁄ ⁄•⁄ω⁄•⁄ ⁄)","(*ﾉωﾉ)","(//ω//)","( ◡‿◡ *)","(ง ื▿ ื)ว",
                                          "(*μ_μ)","( 〃▽〃)","(„ಡωಡ„)","(⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄)"
    
    ]
    
    let japanesTextMojisAnger = ["(╬ Ò﹏Ó)","ヽ( `д´*)ノ","(凸ಠ益ಠ)凸","٩(ఠ益ఠ)۶","(ノ°益°)ノ",
                                 "┌∩┐(◣_◢)┌∩┐","←~(Ψ▼ｰ▼)∈","٩(╬ʘ益ʘ╬)۶","(҂ `з´ )","(`ー´)"
    
    ]
    let japaneseTextMojisSadness = ["(╥_╥)","( ╥ω╥ )","o(〒﹏〒)o","っ˘̩╭╮˘̩)っ","(>_<)","(｡•́︿•̀｡)",
                                    "(μ_μ)","(｡╯︵╰｡)","o(〒﹏〒)o",".｡･ﾟﾟ･(＞_＜)･ﾟﾟ･｡."
    ]
}
